protogia/avr-descriptionfiles-4-nim/svd/ATmega64HVE2.atdf.svd
<?xml version="1.0" encoding="UTF-8"?>
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Atmel</vendor>
  <name>ATmega64HVE2</name>
  <version>1.0</version>
  <description>No description available.</description>
  <cpu>
    <name>other</name>
    <revision>r0p0</revision>
    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <nvicPrioBits>4</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>8</width>
  <size>0x8</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000000FF</resetMask>
  <peripherals>
    <peripheral>
      <name>ADC</name>
      <description>Analog-to-Digital Converter</description>
      <baseAddress>0x000000E0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x17</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ADCRA</name>
          <description>ADC Control Register A</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CKSEL</name>
              <description>Sampling Clock Select</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL_512KHZ_OUTPUT_AS_SAMPLING_CLOCK</name>
                  <description>PLL (512kHz output) as sampling clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLOW_RC_OSCILLATOR_AS_SAMPLING_CLOCK</name>
                  <description>Slow RC Oscillator as sampling clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCMS</name>
              <description>C-ADC Chopper Mode Select</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHOPPING_DISABLED</name>
                  <description>Chopping Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTOMATIC_FAST_CHOPPING</name>
                  <description>Automatic Fast Chopping</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTOMATIC_SLOW_CHOPPING</name>
                  <description>Automatic Slow Chopping</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOFTWARE_POLARITY_CONTROL</name>
                  <description>Software Polarity Control</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADPSEL</name>
              <description>ADC Polarity Select</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCRB</name>
          <description>ADC Control Register B</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADADES</name>
              <description>Accumulated Decimation Ratio Select</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>512</name>
                  <description>512</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <description>256</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128</name>
                  <description>128</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <description>64</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>32</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>16</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>8</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>4</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADIDES</name>
              <description>Instantaneous Decimation Ratio Select</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>512</name>
                  <description>512</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <description>256</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128</name>
                  <description>128</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <description>64</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCRC</name>
          <description>ADC Control Register B</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CADRCT</name>
              <description>C-ADC Regular Current Count Threshold</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <description>1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>4</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>5</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>6</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>7</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>8</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <description>9</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>10</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>11</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <description>12</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <description>13</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>14</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>15</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>16</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CADRCM</name>
              <description>C-ADC Regular Current Comparator Mode</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARATOR_DISABLED</name>
                  <description>Comparator Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPARATOR_ENABLED_REGULAR_CURRENT_COUNTER_COUNTS_UP_IF_ACCUMULATED_CURRENT_IS_ABOVE_THRESHOLD_AND_IS_RESET_IF_ACCUMULATED_CURRENT_IS_BELOW_THRESHOLD</name>
                  <description>Comparator Enabled. Regular Current Counter counts up if Accumulated Current is above threshold and is reset if Accumulated Current is below threshold.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPARATOR_ENABLED_REGULAR_CURRENT_COUNTER_COUNTS_UP_IF_ACCUMULATED_CURRENT_IS_ABOVE_THRESHOLD_AND_DOWN_IF_ACCUMULATED_CURRENT_IS_BELOW_THRESHOLD</name>
                  <description>Comparator Enabled. Regular Current Counter counts up if Accumulated Current is above threshold and down if Accumulated Current is below threshold.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED</name>
                  <description>Reserved</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CADEN</name>
              <description>C-ADC Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCRD</name>
          <description>ADC Control Register D</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CADDSEL</name>
              <description>C-ADC Diagnostics Channel Select</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CADPDM</name>
              <description>C-ADC Pin Diagnostics Mode</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CURRENT_SOURCE_IS_ENABLED</name>
                  <description>No current source is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CURRENT_SOURCE_ON_PI_PIN_ENABLED</name>
                  <description>Current source on PI pin enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CURRENT_SOURCE_ON_NI_PIN_ENABLED</name>
                  <description>Current source on NI pin enabled</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CURRENT_SOURCE_ON_BOTH_PI_NI_PINS_ENABLED</name>
                  <description>Current source on both PI/NI pins enabled</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CADG</name>
              <description>C-ADC Gain</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4X</name>
                  <description>4x</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8X</name>
                  <description>8x</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16X</name>
                  <description>16x</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32X</name>
                  <description>32x</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64X</name>
                  <description>64x</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128X</name>
                  <description>128x</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256X</name>
                  <description>256x</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED</name>
                  <description>Reserved</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCRE</name>
          <description>ADC Control Register E</description>
          <addressOffset>0x6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VADMUX</name>
              <description>V-ADC Channel Select</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PV_NV</name>
                  <description>PV - NV</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_SGND</name>
                  <description>ADC0 - SGND</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC1_SGND</name>
                  <description>ADC1 - SGND</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VTEMP_GND</name>
                  <description>VTEMP - GND</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIAGNOSIS_GND_VREF_TBD</name>
                  <description>DIAGNOSIS - GND (VREF/TBD)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED</name>
                  <description>Reserved</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADPDM</name>
              <description>V-ADC Pin Diagnostics Mode</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CURRENT_SOURCE_IS_ENABLED</name>
                  <description>No current source is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CURRENT_SOURCE_ON_PV_PIN_ENABLED</name>
                  <description>Current source on PV pin enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CURRENT_SOURCE_ON_NV_PIN_ENABLED</name>
                  <description>Current source on NV pin enabled</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CURRENT_SOURCE_ON_BOTH_PV_NV_PINS_ENABLED</name>
                  <description>Current source on both PV/NV pins enabled</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADREFS</name>
              <description>V-ADC Reference Select</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VREF_AS_REFERENCE</name>
                  <description>VREF as reference</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVDD_3_AS_REFERENCE_FOR_DIAGNOSIS_PURPOSE</name>
                  <description>AVDD/3 as reference (for diagnosis purpose)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADEN</name>
              <description>V-ADC Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADIFR</name>
          <description>ADC Interrupt Flag Register</description>
          <addressOffset>0x7</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CADICIF</name>
              <description>C-ADC Instantaneous Current Interrupt Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CADACIF</name>
              <description>C-ADC Accumulated Current Interrupt Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CADRCIF</name>
              <description>C-ADC Regulator Current Interrupt Flag</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VADICIF</name>
              <description>V-DAC Instantaneous Voltage Interrupt Flag</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VADACIF</name>
              <description>V-ADC Accumulated Voltage Interrupt Flag</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
